### 9-14-15

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [5]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                  'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'],
                 'data2': range(3)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [4]:
pd.merge(df1, df2, on = 'key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [16]:
df3 = df1.copy()
df3 = df3.rename(columns = {'key': 'lkey'})

df4 = df2.copy()
df4 = df4.rename(columns = {'key': 'rkey'})

pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [19]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                   'value': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

right1

   group_val
a        3.5
b        7.0

In [20]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [21]:
s1 = Series([0,1], index=['a','b'])
s2 = Series([2,3,4], index=['c','d','e'])
s3 = Series([5,6], index=['f','g'])

pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [22]:
pd.concat([s1, s2, s3], axis=1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [23]:
s4 = pd.concat([s1*5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [24]:
pd.concat([s1,s4], axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [25]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [26]:
df1 = DataFrame(np.random.randn(3,4), columns = ['a', 'b', 'c', 'd'])
df2 = DataFrame(np.random.randn(2,3), columns = ['b', 'd', 'a'])

pd.concat([df1, df2])

          a         b         c         d
0  1.493101 -0.566206  0.319458 -0.929145
1  1.086507  0.906272  0.171885 -1.055503
2  0.698208  0.966297 -0.555492  0.843594
0 -1.219581 -0.624919       NaN  0.725312
1  2.088514 -0.179105       NaN -0.739331

In [27]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  1.493101 -0.566206  0.319458 -0.929145
1  1.086507  0.906272  0.171885 -1.055503
2  0.698208  0.966297 -0.555492  0.843594
3 -1.219581 -0.624919       NaN  0.725312
4  2.088514 -0.179105       NaN -0.739331

In [28]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
           index = ['f', 'e', 'd', 'c', 'b', 'a'])
b = Series(np.arange(len(a), dtype=np.float64),
           index = ['f', 'e', 'd', 'c', 'b', 'a'])

b[:-2]

f    0
e    1
d    2
c    3
dtype: float64

In [29]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  5. ])

In [30]:
data = DataFrame(np.arange(6).reshape(2,3),
                 index = pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns = pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [31]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [32]:
result.index

MultiIndex(levels=[[u'Ohio', u'Colorado'], [u'one', u'two', u'three']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=[u'state', u'number'])

In [33]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [34]:
s1 = Series([0,1,2,3], index = ['a', 'b', 'c', 'd'])
s2 = Series([4,5,6], index = ['c', 'd', 'e'])

data2 = pd.concat([s1, s2], keys =['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [35]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [36]:
df = DataFrame({'left': result, 'right': result + 5},
               columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [37]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [43]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [44]:
data['one'].map({0: "egg", 3: "bacon"})

state
Ohio          egg
Colorado    bacon
Name: one, dtype: object

In [46]:
data = Series([1, -999, 2, -999])
data.replace([-999, 2], 333)

0      1
1    333
2    333
3    333
dtype: int64

In [56]:
ages = np.arange(20, 34, 2)
cats = pd.cut(ages, [20, 25, 30, 35], right=False)

cats

[[20, 25), [20, 25), [20, 25), [25, 30), [25, 30), [30, 35), [30, 35)]
Categories (3, object): [[20, 25) < [25, 30) < [30, 35)]

In [57]:
cats.categories

Index([u'[20, 25)', u'[25, 30)', u'[30, 35)'], dtype='object')

In [58]:
cats.codes

array([0, 0, 0, 1, 1, 2, 2], dtype=int8)

In [59]:
data = np.random.randn(1000)
cats = pd.qcut(data, 5) #quintiles

pd.value_counts(cats)

(0.85, 2.931]       200
(0.185, 0.85]       200
(-0.265, 0.185]     200
(-0.815, -0.265]    200
[-3.332, -0.815]    200
dtype: int64

In [61]:
data = DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000151     0.020019    -0.045629    -0.027468
std       0.978853     1.051852     0.998041     1.015420
min      -3.488071    -3.400378    -3.735053    -3.310642
25%      -0.637337    -0.699423    -0.714981    -0.712512
50%      -0.027262     0.036991    -0.093877    -0.012255
75%       0.646397     0.729844     0.613339     0.669617
max       3.096262     3.328490     2.800171     2.879938

In [64]:
col = data[3]
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
93  -1.572898  1.713499  0.783463 -3.310642
137 -0.254547  3.135835 -3.357257  1.094903
271  3.096262  0.354789  0.342074 -1.568225
303 -1.829779  0.886337  1.149133 -3.045175
311  0.925902  3.328490  0.494162  0.656562
359 -0.850787  3.224280  0.946562  0.252774
494  1.620059  0.818212 -3.735053  0.645314
631 -0.369987 -3.314507 -0.332392 -0.901093
730 -0.298300 -3.126313 -1.198241 -1.893725
832 -1.605302 -0.521982  0.881099 -3.000746
925 -3.488071  2.373942 -0.456843  0.526578
938  1.020098  3.052406 -0.922667  0.088211
994 -0.818835 -3.400378 -1.310938  1.598666

In [65]:
#trim the outliers...

data[np.abs(data) > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000241     0.020119    -0.044537    -0.027111
std       0.976932     1.047106     0.994462     1.014326
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.637337    -0.699423    -0.714981    -0.712512
50%      -0.027262     0.036991    -0.093877    -0.012255
75%       0.646397     0.729844     0.613339     0.669617
max       3.000000     3.000000     2.800171     2.879938

In [66]:
pd.get_dummies(Series(['a', 'b', 'b', 'd', 'c']))

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  1  0  0
3  0  0  0  1
4  0  0  1  0